depot/app/controllers/products_controller.rb

INSERT INTO "products" ("created_at", "description", "image_url", "price", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @product = Product.new(params[:product])

    respond_to do |format|
      if @product.save

SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", "980190962"]]
---
  def update
    @product = Product.find(params[:id])

SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", "980190962"]]
DELETE FROM "products" WHERE "products"."id" = ?  [["id", 980190962]]
---
  def destroy
    @product = Product.find(params[:id])
    @product.destroy